app/views/users/show.html.erb


<% if @user.articles.any? %>
---
SELECT  1 AS one FROM "articles" WHERE "articles"."user_id" = $1 LIMIT 1  [["user_id", 2]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 2]]