app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "awesome post"], ["text", "great job!"], ["created_at", "2015-04-26 01:37:10.622907"], ["updated_at", "2015-04-26 01:37:10.622907"]]
---
	def create
		user = User.find(session[:id])
		@article = Article.new(article_params)

		if	@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 56]]
UPDATE "articles" SET "text" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["text", "this site is cool this is insane editing"], ["updated_at", "2015-04-28 00:15:34.777107"], ["id", 56]]
---
	def update
		@article = Article.find(params[:id])
		if @article.update(article_params)