app/controllers/comments_controller.rb

	def create
		user = User.find(session[:id])
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "josh"], ["body", "this is awesome!"], ["article_id", 1], ["created_at", "2015-04-26 12:45:29.790120"], ["updated_at", "2015-04-26 12:45:29.790120"]]

	def destroy
		article = Article.find(params[:article_id])
		comment = article.comments.find(params[:id])
		comment.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["article_id", 1], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]